Conf.Simple/src/Catalogs/SUI_ПрисоединенныеФайлыОбщие/SUI_ПрисоединенныеФайлыОбщие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SUI_ПрисоединенныеФайлыОбщие</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецФайла</name>
    <type>
      <types>CatalogRef.SUI_НастройкиКонфигурацийПриложений</types>
      <types>CatalogRef.SUI_КонфигурацииПриложений</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольнаяСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Модифицировал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

Conf.Simple/src/Catalogs/SUI_ПрисоединенныеФайлыОбщие/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получить двоичные данные из ссылки присоединенного файла.
// 
// Параметры:
//  СсылкаНаПрисоединенныйФайл - СправочникСсылка.SUI_ПрисоединенныеФайлыОбщие - Ссылка на присоединенный файл
//  ВернутьКакBase64 - Булево - Закодировать двоичные данные по алгоритму Base64
// 
// Возвращаемое значение:
//  Строка, ДвоичныеДанные, Неопределено - Двоичные данные или строка Base64 двоичных данных присоединенного файла. Если двоичные данные не существуют, то Неопределено.
Функция ПолучитьДвоичныеДанныеИзСсылки(СсылкаНаПрисоединенныйФайл, ВернутьКакBase64 = Ложь) Экспорт
	
	Перем Данные;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	SUI_ПрисоединенныеФайлыОбщие.ФайлХранилище
		|ИЗ
		|	Справочник.SUI_ПрисоединенныеФайлыОбщие КАК SUI_ПрисоединенныеФайлыОбщие
		|ГДЕ
		|	SUI_ПрисоединенныеФайлыОбщие.Ссылка = &СсылкаНаПрисоединенныйФайл";
	
	Запрос.УстановитьПараметр("СсылкаНаПрисоединенныйФайл", СсылкаНаПрисоединенныйФайл);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();

		ОписаниеТипаДвоичныеДанные = Новый ОписаниеТипов("ДвоичныеДанные");
		ДвоичныеДанныеФайла = ОписаниеТипаДвоичныеДанные.ПривестиЗначение(Выборка.ФайлХранилище.Получить());
		
		Если ЗначениеЗаполнено(ДвоичныеДанныеФайла) Тогда
			
			Данные = ДвоичныеДанныеФайла;
			
			Если ВернутьКакBase64 Тогда
				Данные = Base64Строка(Данные);
			КонецЕсли;
			
		КонецЕсли;

	КонецЕсли;

	Возврат Данные;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция СтруктураЗаполнения() Экспорт
	
	СтруктураЗаполнения = Новый Структура();
	
	СтруктураЗаполнения.Вставить("ВладелецФайла");
	СтруктураЗаполнения.Вставить("Наименование");
	СтруктураЗаполнения.Вставить("ДвоичныеДанные");
	СтруктураЗаполнения.Вставить("ПутьКФайлу");
	
	Возврат СтруктураЗаполнения;
	
КонецФункции

Функция ПолучитьСведенияОДвоичныхДанных(ДвоичныеДанные) Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("ДвоичныеДанные");
	Результат.Вставить("Размер");
	Результат.Вставить("КонтрольнаяСумма");
	
	ОписаниеТипаДвоичныеДанные = Новый ОписаниеТипов("ДвоичныеДанные");
	Результат.ДвоичныеДанные = ОписаниеТипаДвоичныеДанные.ПривестиЗначение(ДвоичныеДанные);
	Результат.Размер = Результат.ДвоичныеДанные.Размер();
	Результат.КонтрольнаяСумма = ОбщегоНазначения.КонтрольнаяСуммаСтрокой(Результат.ДвоичныеДанные, ХешФункция.SHA1);

	Возврат Результат;
	
КонецФункции

Функция ПолучитьСведенияОПутиФайла(ПутьКФайлу) Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("ПутьКФайлу");
	Результат.Вставить("ИмяФайла", "");
	Результат.Вставить("Расширение", "");
	
	Результат.ПутьКФайлу = ОбщегоНазначения.ОписаниеТипаСтрока(0).ПривестиЗначение(ПутьКФайлу);
	
	МассивПодстрокПутиКФайлу = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
		Результат.ПутьКФайлу, ПолучитьРазделительПути(), Истина, Истина);
		
	Если МассивПодстрокПутиКФайлу.ВГраница() >= 0 Тогда
		
		Результат.Расширение = ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(МассивПодстрокПутиКФайлу[МассивПодстрокПутиКФайлу.ВГраница()]);
		Результат.ИмяФайла = СтрЗаменить(МассивПодстрокПутиКФайлу[МассивПодстрокПутиКФайлу.ВГраница()], Результат.Расширение, "");
		
		Если Прав(Результат.ИмяФайла, 1) = "."  Тогда
			Результат.ИмяФайла = Лев(Результат.ИмяФайла, СтрДлина(Результат.ИмяФайла) - 1);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
